# InsulationLiningBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationLiningBase Class
Members See Also
---
Acts as the base class for duct insulation, pipe insulation and duct lining elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class InsulationLiningBase : MEPCurve
```

Visual Basic
---
```text
Public Class InsulationLiningBase _
	Inherits MEPCurve
```

Visual C++
---
```text
public ref class InsulationLiningBase : public MEPCurve
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB..::..InsulationLiningBase Autodesk.Revit.DB.Mechanical..::..DuctInsulation Autodesk.Revit.DB.Mechanical..::..DuctLining Autodesk.Revit.DB.Plumbing..::..PipeInsulation
# See Also
InsulationLiningBase Members
Autodesk.Revit.DB Namespace